content/index.org
#+TITLE: Richard Davis, Composer
#+SUBTITLE: Home
#+AUTHOR: Richard Davis
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup

#+INCLUDE: ../resources/header.org

* About

Hello!
My name is Richard Davis.
I am a Montreal- and Massachusetts-based composer, viola performer, and teacher.
My primary musical interests are intertextuality, live electronics, vocal or vocal-emulating music, and computer-assisted composition.

* Links

** Listening

- [[https://youtube.com/@davisrichard437][YouTube Channel]]
- [[https://soundcloud.com/richard-davis-333277866][SoundCloud]]

** Miscellaneous

Some might be interested in my [[https://gitlab.com/davisrichard437][GitLab]], which has a number of Python scripts I've written in the past for various computer-assisted composition tasks.

* Contact

Send me an email at [[mailto:davisrichard437@gmail.com][davisrichard437@gmail.com]]!
