index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-11-25 Fri 06:23 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Richard Davis, Composer</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Richard Davis" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Richard Davis, Composer
<br />
<span class="subtitle">Home</span>
</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3db1835">About</a></li>
<li><a href="#org52aa159">Links</a>
<ul>
<li><a href="#org180d5cd">Listening</a></li>
<li><a href="#org71556a5">Miscellaneous</a></li>
</ul>
</li>
<li><a href="#org2e2e61c">Contact</a></li>
</ul>
</div>
</div>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="./index.html">Home</a></td>
<td class="org-left"><a href="./events.html">Events</a></td>
<td class="org-left"><a href="./press.html">Press</a></td>
<td class="org-left"><a href="./listening.html">Listening</a></td>
</tr>
</tbody>
</table>

<div id="outline-container-org3db1835" class="outline-2">
<h2 id="org3db1835">About</h2>
<div class="outline-text-2" id="text-org3db1835">
<p>
Hello!
My name is Richard Davis.
I am a Montreal- and Massachusetts-based composer, viola performer, and teacher.
My primary musical interests are intertextuality, live electronics, vocal or vocal-emulating music, and computer-assisted composition.
</p>
</div>
</div>

<div id="outline-container-org52aa159" class="outline-2">
<h2 id="org52aa159">Links</h2>
<div class="outline-text-2" id="text-org52aa159">
</div>
<div id="outline-container-org180d5cd" class="outline-3">
<h3 id="org180d5cd">Listening</h3>
<div class="outline-text-3" id="text-org180d5cd">
<ul class="org-ul">
<li><a href="https://youtube.com/@davisrichard437">YouTube Channel</a></li>
<li><a href="https://soundcloud.com/richard-davis-333277866">SoundCloud</a></li>
</ul>
</div>
</div>

<div id="outline-container-org71556a5" class="outline-3">
<h3 id="org71556a5">Miscellaneous</h3>
<div class="outline-text-3" id="text-org71556a5">
<p>
Some might be interested in my <a href="https://gitlab.com/davisrichard437">GitLab</a>, which has a number of Python scripts I've written in the past for various computer-assisted composition tasks.
</p>
</div>
</div>
</div>

<div id="outline-container-org2e2e61c" class="outline-2">
<h2 id="org2e2e61c">Contact</h2>
<div class="outline-text-2" id="text-org2e2e61c">
<p>
Send me an email at <a href="mailto:davisrichard437@gmail.com">davisrichard437@gmail.com</a>!
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Richard Davis</p>
<p class="date">Created: 2022-11-25 Fri 06:23</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
